# Occupation.

In [2]:
import pandas as pd

  user_id|age|gender|occupation|zip_code
0                1|24|M|technician|85711
1                     2|53|F|other|94043
2                    3|23|M|writer|32067
3                4|24|M|technician|43537
4                     5|33|F|other|15213

** 1.) **  What's wrong with the above dataframe is we need to specify | as the seperator, check out the [documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.read_csv.html)
on how to or use help mode inside the jupyter notebook `?`.

In [3]:
# %load solutions/readDf.py

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

** 2.) ** How many rows and columns does the dataframe have?

In [4]:
# %load solutions/findshape.py

(943, 5)

In [13]:
df.gender = df.gender.astype("category");

** 3.) ** What is the statistical summary for the occupation dataset? What is the ratio of male and female?

In [5]:
# %load solutions/summary.py

           user_id         age gender occupation zip_code
count   943.000000  943.000000    943        943      943
unique         NaN         NaN      2         21      795
top            NaN         NaN      M    student    55414
freq           NaN         NaN    670        196        9
mean    472.000000   34.051962    NaN        NaN      NaN
std     272.364951   12.192740    NaN        NaN      NaN
min       1.000000    7.000000    NaN        NaN      NaN
25%     236.500000   25.000000    NaN        NaN      NaN
50%     472.000000   31.000000    NaN        NaN      NaN
75%     707.500000   43.000000    NaN        NaN      NaN
max     943.000000   73.000000    NaN        NaN      NaN

 ** 4.) ** Sort the mean age of student in ascending order, which occupation is the youngest?

In [6]:
# %load solutions/sortMean.py

occupation
student          22.081633
none             26.555556
entertainment    29.222222
artist           31.392857
homemaker        32.571429
programmer       33.121212
technician       33.148148
other            34.523810
scientist        35.548387
salesman         35.666667
writer           36.311111
engineer         36.388060
lawyer           36.750000
marketing        37.615385
executive        38.718750
administrator    38.746835
librarian        40.000000
healthcare       41.562500
educator         42.010526
doctor           43.571429
retired          63.071429
Name: age, dtype: float64

** 5.) ** what is the male to female ratio for each occupation?

In [7]:
# %load solutions/Male2Female.py

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

 ** 6.) ** what is the maximun and minimum age for each occupation?

In [24]:
#group by and use the aggregate function

               max  min  median
occupation
student         42    7    21.0
entertainment   50   15    25.0
none            55   11    26.0
artist          48   19    30.0
programmer      63   20    30.0
technician      55   21    30.0
homemaker       50   20    32.0
other           64   13    32.0
salesman        66   18    34.0
lawyer          53   21    34.0
writer          60   18    36.0
engineer        70   22    36.0
marketing       55   24    36.0
scientist       55   23    37.0
administrator   70   21    37.0
executive       69   22    38.5
librarian       69   23    39.0
educator        63   23    42.0
healthcare      62   22    44.5
doctor          64   28    45.0
retired         73   51    63.0